app/controllers/articles_controller.rb

	def create
		# @article = Article.new(params.require(:article).permit(:title, :text))
		@article = Article.new(article_params)

		@article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('asas', '', '2015-08-25 12:42:23', '2015-08-25 12:42:23')

	def show
		puts "----"
		puts params[:id]
		# @article = Article.find(params[:id])
		@article = Article.find('5')
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1